[
    "Why don’t skeletons fight each other? They don’t have the guts.",
    "What do you call fake spaghetti? An impasta.",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "I used to play piano by ear, but now I use my hands.",
    "Why don't some couples go to the gym? Because some relationships don't work out.",
    "I would tell you a joke about an elevator, but it’s an uplifting experience.",
    "Why did the scarecrow win an award? Because he was outstanding in his field.",
    "How do you organize a space party? You planet.",
    "Why don’t eggs tell jokes? They’d crack each other up.",
    "I told my wife she was getting too emotional during the wedding. She said it was just her bridal tears.",
    "What’s orange and sounds like a parrot? A carrot.",
    "I couldn’t figure out how to put my seatbelt on. Then it clicked.",
    "Did you hear about the mathematician who’s afraid of negative numbers? He will stop at nothing to avoid them.",
    "Why do chicken coops only have two doors? Because if they had four, they’d be chicken sedans.",
    "I’m reading a book on anti-gravity. It’s impossible to put down.",
    "I asked my dog what’s two minus two. He said nothing.",
    "Why did the bicycle fall over? It was two-tired.",
    "I used to be a baker, but I couldn’t make enough dough.",
    "I would tell you a joke about a roof, but it’s over your head.",
    "I’m on a whiskey diet. I’ve lost three days already.",
    "What do you call cheese that isn’t yours? Nacho cheese.",
    "I don’t trust stairs because they’re always up to something.",
    "I used to be a doctor, but I lost my patience.",
    "Did you hear about the claustrophobic astronaut? He just needed a little space.",
    "Why did the math book look sad? Because it had too many problems.",
    "I used to play sports, but then I realized you can’t drink beer while playing them.",
    "What do you call an alligator in a vest? An investigator.",
    "I can’t believe I got fired from the calendar factory. All I did was take a day off.",
    "What’s a skeleton’s least favorite room? The living room.",
    "Why do cows have hooves instead of feet? Because they lactose.",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
    "I used to play soccer, but I could never kick the habit.",
    "What do you get when you cross a snowman and a vampire? Frostbite.",
    "I asked the librarian if the library had any books on paranoia. She whispered, 'They’re right behind you.'",
    "I don’t know why I started eating at a bakery. It’s just crumby.",
    "What do you call a dog magician? A labracadabrador.",
    "Why was the broom late? It swept in.",
    "I made a pun about the wind, but it blows.",
    "What did the fish say when it hit the wall? Dam.",
    "I told my computer I needed a break, and now it won’t stop sending me kitteh videos.",
    "I don’t trust people who do acupuncture. They’re back stabbers.",
    "What do you call a pile of cats? A meow-tain.",
    "Why did the tomato turn red? Because it saw the salad dressing.",
    "I don't play soccer because I enjoy the sport. I'm just doing it for kicks.",
    "Why did the computer go to the doctor? It had a virus.",
    "I can’t believe I got fired from the clock factory. All I did was watch the time.",
    "What did one wall say to the other? I'll meet you at the corner.",
    "I’m reading a book about anti-gravity. It’s impossible to put down.",
    "I’m afraid for the calendar. Its days are numbered.",
    "Why don’t oysters donate to charity? Because they’re shellfish.",
    "I have a joke about construction, but I’m still working on it.",
    "What did the baby corn say to the mama corn? Where’s popcorn?"
]
